
&НаКлиенте
&Вместо("ЗакрытьСВыбраннымРезультатом")
Процедура Расш1_ЗакрытьСВыбраннымРезультатом()
	Если ТипЗнч(ВладелецФормы) = Тип("Полеформы") Тогда
		Расш1_ЗакрытьСВыбраннымРезультатомПОдмена();
	Иначе	 		
		ПродолжитьВызов();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ЗакрытьСВыбраннымРезультатомПОдмена()	
	
	ТекущийКодПоОКОФ = Элементы.ИерархияОКОФ.ТекущиеДанные;
	Если ТекущийКодПоОКОФ <> Неопределено Тогда
		ОКОФ = ТекущийКодПоОКОФ.Ссылка;
		ОКОФНаименование = ТекущийКодПоОКОФ.Наименование;
	Иначе
		ОКОФ = ПредопределенноеЗначение("Справочник.ОбщероссийскийКлассификаторОсновныхФондов.ПустаяСсылка");
		ОКОФНаименование = "";
	КонецЕсли;
	
	ТекущаяАмортизационнаяГруппа = Элементы.АмортизационныеГруппыТаблица.ТекущиеДанные;
	Если ТекущаяАмортизационнаяГруппа <> Неопределено Тогда
		АмортизационнаяГруппа = ТекущаяАмортизационнаяГруппа.АмортизационнаяГруппа;
	Иначе
		АмортизационнаяГруппа = ПредопределенноеЗначение("Перечисление.АмортизационныеГруппы.ПустаяСсылка");
	КонецЕсли;
	
	ПараметрЗакрытия = Новый Структура("ОКОФ, ОКОФНаименование, АмортизационнаяГруппа,ВладелецФормыВыбора", 
										ОКОФ, ОКОФНаименование, АмортизационнаяГруппа, ВладелецФормы.Имя);
	
	Оповестить("ВыборАмортизационнойГруппыОС", ПараметрЗакрытия, ВладелецФормы);
	
	Закрыть();
	
		
КонецПроцедуры
