
&НаСервере
Процедура Расш1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Если Параметры.ДополнительныеПараметры.Количество()<>0 Тогда
		Если Параметры.ДополнительныеПараметры.Свойство("ИнвентаризацияОС") Тогда
			
			ИсключаемыеСсылки = Неопределено;
			Параметры.Свойство("ИсключаемыеСсылки", ИсключаемыеСсылки);
			
			ОтображениеСписком = Истина;
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список,
			"Ссылка",
			ПланыСчетов.Хозрасчетный.СчетаСНаборомВыбранныхСубконто(Параметры.ДополнительныеПараметры.ВидыСубконтно, ИсключаемыеСсылки),
			ВидСравненияКомпоновкиДанных.ВСписке,,
			Истина);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

