&НаКлиенте
Перем Расш1_ВТаблице;

&НаКлиенте
Перем Расш1_Основное;

&НаКлиенте
Процедура Расш1_АналитикаРасходовНачалоВыбораПосле(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		
	Расш1_Основное = Истина;
	Расш1_ДругиеСтатьи = Ложь;
	ПартииТМЦ =  Расш1_ОпределениеТипаАналитики.Расш1_ОпределениеТипаАналитикиНаСервере(Объект.СтатьяРасходов);
	Если ПартииТМЦ Тогда
		СтандартнаяОбработка = Ложь;
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ДатаДокумента",Объект.Дата);
		ПараметрыПодбора = Новый Структура("ЗакрыватьПриВыборе, МножественныйВыбор,РежимВыбора, ДополнительныеПараметры", Истина, Ложь, Истина, ДополнительныеПараметры);
		ОткрытьФорму("Справочник.ПартииТМЦВЭксплуатации.Форма.ФормаПодбора", ПараметрыПодбора, ЭтаФорма);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Расш1_ОбработкаВыбораПосле(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Справочник.ПартииТМЦВЭксплуатации.Форма.ФормаПодбора" Тогда
		Если ТипЗнч(ВыбранноеЗначение) = Тип("ФиксированныйМассив") Тогда
			СтандартнаяОбработка = Ложь;
			Для Каждого Значение ИЗ ВыбранноеЗначение Цикл
				Если Расш1_Основное Тогда
					Объект.АналитикаРасходов = Значение.ПартияТМЦВЭксплуатации; 
				ИначеЕсли Расш1_ВТаблице Тогда
					СтрокаТаблицы = Элементы.РаспределениеРасходов.ТекущиеДанные;
					СтрокаТаблицы.АналитикаРасходов = Значение.ПартияТМЦВЭксплуатации;
				КонецЕсли;
			КонецЦикла;
			Модифицированность = Истина;
		КонецЕсли;
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура Расш1_РаспределениеРасходовАналитикаРасходовНачалоВыбораПосле(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Расш1_Основное = Ложь;
	Расш1_ВТаблице = Истина;
	СтрокаТаблицы = Элементы.РаспределениеРасходов.ТекущиеДанные;
	СтатьяРасходов = СтрокаТаблицы.СтатьяРасходов;
	ПартииТМЦ = Расш1_ОпределениеТипаАналитики.Расш1_ОпределениеТипаАналитикиНаСервере(СтатьяРасходов);
	Если ПартииТМЦ Тогда
		СтандартнаяОбработка = Ложь;
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ДатаДокумента",Объект.Дата);
		ПараметрыПодбора = Новый Структура("ЗакрыватьПриВыборе, МножественныйВыбор,РежимВыбора, ДополнительныеПараметры", Истина, Ложь, Истина, ДополнительныеПараметры);
		ОткрытьФорму("Справочник.ПартииТМЦВЭксплуатации.Форма.ФормаПодбора", ПараметрыПодбора, ЭтаФорма);
	КонецЕсли;

КонецПроцедуры
