
&НаКлиенте
Процедура Расш1_ЗаполнитьПоСчетуПеред(Команда)
	
	ПродолжитьЗаполнениеПоСчету("ЗаполнитьПоСчету");
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьЗаполнениеПоСчету(Действия)
	
	ТекстВопроса = НСтр(
	"ru = 'При заполнении существующие данные будут перезаполнены.
	|Продолжить?'");
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ПродолжитьЗаполнениеОстатковПоСчету", ЭтаФорма, Новый Структура(Действия)),
	ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьЗаполнениеОстатковПоСчету(Результат, ДополнительныеПараметры=Неопределено) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Или ДополнительныеПараметры=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры.Свойство("ЗаполнитьПоСчету") Тогда
		МассивСубконто = ПолучитьСубконто();
		ДопПараметры = Новый Структура("ИнвентаризацияОС", Истина);
		ДопПараметры.Вставить("ВидыСубконтно",МассивСубконто);
		ПараметрыПодбора = Новый Структура("ЗакрыватьПриВыборе, МножественныйВыбор,РежимВыбора,ДополнительныеПараметры", Истина, Ложь, Истина, ДопПараметры);
		Счет = ОткрытьФорму("ПланСчетов.Хозрасчетный.Форма.ФормаВыбора",ПараметрыПодбора,ЭтаФорма);
	КонецЕсли;
	   
КонецПроцедуры

&НаСервере
Функция ПолучитьСубконто()
	
	МассивВидовСубконтоОС = Новый Массив;
	МассивВидовСубконтоОС.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства);
	МассивВидовСубконтоОС.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОбъектыСтроительства);
	
	Возврат МассивВидовСубконтоОС;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПоСчетуСервер(Счет) Экспорт
	
	ЗаполнитьТЧ(,,Счет);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧ(ЗаполнитьПоСпискуОС=Ложь, Знач Строки=Неопределено, Счет = Неопределено)
	
	УстановитьПривилегированныйРежим(Истина);
	
	МассивСтрок = Неопределено;
	Если ЗаполнитьПоСпискуОС И Строки <> Неопределено Тогда
		МассивСтрок = Новый Массив;
		Если ТипЗнч(Строки) = Тип("Массив") Тогда
			Для Каждого ИдентификаторСтроки Из Строки Цикл
				МассивСтрок.Добавить(Объект.ОС.НайтиПоИдентификатору(ИдентификаторСтроки));
			КонецЦикла;
		Иначе
			МассивСтрок.Добавить(Строки);
		КонецЕсли;
	КонецЕсли;
	
	Если ЗаполнитьПоСпискуОС Тогда
		ТаблицаОС = Объект.ОС.Выгрузить(МассивСтрок);
	Иначе
		ТаблицаОС = Объект.ОС.Выгрузить().СкопироватьКолонки();
	КонецЕсли;
	
	МВТ = Новый МенеджерВременныхТаблиц;
	
	Документы.ИнвентаризацияОС.ДобавитьВременнуюТаблицуСозданныхДокументовНаОсновании(МВТ, Объект.Ссылка);
	
	МассивВидовСубконтоОС = Новый Массив;
	МассивВидовСубконтоОС.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства);
	МассивВидовСубконтоОС.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОбъектыСтроительства);
		
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	Запрос.УстановитьПараметр("ДанныеДокумента", ТаблицаОС);
	Запрос.УстановитьПараметр("ЗаполнитьПоСпискуОС", ЗаполнитьПоСпискуОС);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Подразделение", Объект.ПодразделениеОрганизации);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("МассивВидовСубконтоОС", МассивВидовСубконтоОС);
	Запрос.УстановитьПараметр("СчетУчета", Счет);
	
	
	#Область ТекстЗапроса
	Запрос.Текст = "ВЫБРАТЬ
	|	(ВЫРАЗИТЬ(ДанныеДокумента.НомерСтроки КАК ЧИСЛО)) - 1 КАК ИндексСтроки,
	|	ВЫРАЗИТЬ(ДанныеДокумента.ОсновноеСредство КАК Справочник.ОбъектыЭксплуатации) КАК ОсновноеСредство,
	|	ВЫРАЗИТЬ(ДанныеДокумента.СчетУчета КАК ПланСчетов.Хозрасчетный) КАК СчетУчета,
	|	ВЫРАЗИТЬ(ДанныеДокумента.МОЛ КАК Справочник.ФизическиеЛица) КАК МОЛ,
	|	ВЫРАЗИТЬ(ДанныеДокумента.СтоимостьФактическая КАК ЧИСЛО) КАК СтоимостьФактическая,
	|	ВЫРАЗИТЬ(ДанныеДокумента.НаличиеФактическое КАК БУЛЕВО) КАК НаличиеФактическое
	|ПОМЕСТИТЬ втДанныеДокумента
	|ИЗ
	|	&ДанныеДокумента КАК ДанныеДокумента
	|;
	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(Состояния.ОсновноеСредство, втДанныеДокумента.ОсновноеСредство) КАК ОсновноеСредство,
	|	Состояния.Организация КАК Организация,
	|	ЕСТЬNULL(втДанныеДокумента.ИндексСтроки, НЕОПРЕДЕЛЕНО) КАК ИндексСтроки,
	|	ЕСТЬNULL(Состояния.Состояние, НЕОПРЕДЕЛЕНО) КАК Состояние,
	|	НЕ СостоянияАрендодателя.ОсновноеСредство ЕСТЬ NULL КАК АрендодательОрганизация,
	|	втДанныеДокумента.СчетУчета КАК СчетУчета,
	|	втДанныеДокумента.МОЛ КАК МОЛ
	|ПОМЕСТИТЬ втДанныеДокументаИСостояние
	|ИЗ
	|	РегистрСведений.СостоянияОСОрганизаций.СрезПоследних(
	|			&Дата,
	|			Организация = &Организация
	|				И (НЕ &ЗаполнитьПоСпискуОС
	|					ИЛИ ОсновноеСредство В
	|						(ВЫБРАТЬ
	|							Т.ОсновноеСредство
	|						ИЗ
	|							втДанныеДокумента КАК Т))) КАК Состояния
	|		ПОЛНОЕ СОЕДИНЕНИЕ втДанныеДокумента КАК втДанныеДокумента
	|		ПО (Состояния.ОсновноеСредство = втДанныеДокумента.ОсновноеСредство)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияОСОрганизаций.СрезПоследних(
	|				&Дата,
	|				Организация <> &Организация
	|					И Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ПринятоКУчету)
	|					И (НЕ &ЗаполнитьПоСпискуОС
	|						ИЛИ ОсновноеСредство В
	|							(ВЫБРАТЬ
	|								Т.ОсновноеСредство
	|							ИЗ
	|								втДанныеДокумента КАК Т))) КАК СостоянияАрендодателя
	|		ПО (Состояния.ОсновноеСредство = СостоянияАрендодателя.ОсновноеСредство)
	|			И (ЕСТЬNULL(Состояния.Состояние, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ПринятоКЗабалансовомуУчету))
	|ГДЕ
	|	(НЕ &ЗаполнитьПоСпискуОС
	|			ИЛИ НЕ втДанныеДокумента.ОсновноеСредство ЕСТЬ NULL)
	|	И (&ЗаполнитьПоСпискуОС
	|			ИЛИ ЕСТЬNULL(Состояния.Состояние, НЕОПРЕДЕЛЕНО) В (ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ПринятоКУчету), ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ПринятоКЗабалансовомуУчету)))
	|;
	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДанныеДокументаИСостояние.ИндексСтроки КАК ИндексСтроки,
	|	втДанныеДокументаИСостояние.ОсновноеСредство КАК ОсновноеСредство,
	|	втДанныеДокументаИСостояние.Организация КАК Организация,
	|	втДанныеДокументаИСостояние.АрендодательОрганизация КАК АрендодательОрганизация,
	|	ПервоначальныеСведения.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	Местонахождения.Местонахождение КАК Подразделение,
	|	ВЫБОР
	|		КОГДА НЕ &ЗаполнитьПоСпискуОС
	|			ТОГДА ЕСТЬNULL(СчетаБухгалтерскогоУчета.СчетУчета, ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка))
	|		КОГДА втДанныеДокументаИСостояние.СчетУчета = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(СчетаБухгалтерскогоУчета.СчетУчета, ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка))
	|		ИНАЧЕ втДанныеДокументаИСостояние.СчетУчета
	|	КОНЕЦ КАК СчетУчета,
	|	ЕСТЬNULL(Местонахождения.МОЛ, втДанныеДокументаИСостояние.МОЛ) КАК МОЛ,
	|	СчетаБухгалтерскогоУчета.СчетУчета КАК СчетУчетаПоДаннымУчета,
	|	ПараметрыЦелевогоФинансирования.СчетУчета КАК СчетУчетаЦФПоДаннымУчета,
	|	ЕСТЬNULL(Местонахождения.МОЛ, ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) КАК МОЛПоДаннымУчета,
	|	втДанныеДокументаИСостояние.Состояние КАК Состояние
	|ПОМЕСТИТЬ втСведения
	|ИЗ
	|	втДанныеДокументаИСостояние КАК втДанныеДокументаИСостояние
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет.СрезПоследних(
	|				&Дата,
	|				Организация = &Организация
	|					И (НЕ &ЗаполнитьПоСпискуОС
	|						ИЛИ ОсновноеСредство В
	|							(ВЫБРАТЬ
	|								Т.ОсновноеСредство
	|							ИЗ
	|								втДанныеДокумента КАК Т))) КАК ПервоначальныеСведения
	|		ПО (втДанныеДокументаИСостояние.ОсновноеСредство = ПервоначальныеСведения.ОсновноеСредство)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СчетаБухгалтерскогоУчетаОС.СрезПоследних(
	|				&Дата,
	|				Организация = &Организация
	|					И ОсновноеСредство В
	|						(ВЫБРАТЬ
	|							Т.ОсновноеСредство
	|						ИЗ
	|							втДанныеДокументаИСостояние КАК Т)) КАК СчетаБухгалтерскогоУчета
	|		ПО (втДанныеДокументаИСостояние.ОсновноеСредство = СчетаБухгалтерскогоУчета.ОсновноеСредство)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестонахождениеОСБухгалтерскийУчет.СрезПоследних(
	|				&Дата,
	|				Организация = &Организация
	|					И ОсновноеСредство В
	|						(ВЫБРАТЬ
	|							Т.ОсновноеСредство
	|						ИЗ
	|							втДанныеДокументаИСостояние КАК Т)) КАК Местонахождения
	|		ПО (втДанныеДокументаИСостояние.ОсновноеСредство = Местонахождения.ОсновноеСредство)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыЦелевогоФинансированияОС.СрезПоследних(
	|				&Дата,
	|				ОсновноеСредство В
	|					(ВЫБРАТЬ
	|						Т.ОсновноеСредство
	|					ИЗ
	|						втДанныеДокументаИСостояние КАК Т)) КАК ПараметрыЦелевогоФинансирования
	|		ПО (НЕ ПервоначальныеСведения.Организация ЕСТЬ NULL)
	|			И (ПараметрыЦелевогоФинансирования.ПрименениеЦелевогоФинансирования)
	|			И (втДанныеДокументаИСостояние.ОсновноеСредство = ПараметрыЦелевогоФинансирования.ОсновноеСредство)
	|ГДЕ
	|	(&ЗаполнитьПоСпискуОС
	|			ИЛИ Местонахождения.Местонахождение = &Подразделение)
	|	И СчетаБухгалтерскогоУчета.СчетУчета В Иерархии(&СчетУчета)
	|	И ПараметрыЦелевогоФинансирования.СчетУчета В Иерархии(&СчетУчета)
	|;
	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втСведения.ОсновноеСредство КАК ОсновноеСредство,
	|	втСведения.СчетУчета КАК СчетУчета,
	|	ЕСТЬNULL(ХозрасчетныйОстатки.СуммаОстаток, 0) + ЕСТЬNULL(ХозрасчетныйОстаткиЦФ.СуммаОстаток, 0) КАК Сумма
	|ПОМЕСТИТЬ втСтоимости01
	|ИЗ
	|	втСведения КАК втСведения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Остатки(
	|				&Дата,
	|				Счет В Иерархии(&СчетУчета),
	|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства),
	|				Организация = &Организация
	|					И Подразделение = &Подразделение
	|					И Субконто1 В
	|						(ВЫБРАТЬ
	|							Т.ОсновноеСредство
	|						ИЗ
	|							втСведения КАК Т)) КАК ХозрасчетныйОстатки
	|		ПО втСведения.ОсновноеСредство = ХозрасчетныйОстатки.Субконто1
	|			И втСведения.СчетУчета = ХозрасчетныйОстатки.Счет
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Остатки(
	|				&Дата,
	|				Счет В Иерархии(&СчетУчета),
	|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства),
	|				Организация = &Организация
	|					И Подразделение = &Подразделение
	|					И Субконто1 В
	|						(ВЫБРАТЬ
	|							Т.ОсновноеСредство
	|						ИЗ
	|							втСведения КАК Т)) КАК ХозрасчетныйОстаткиЦФ
	|		ПО втСведения.ОсновноеСредство = ХозрасчетныйОстаткиЦФ.Субконто1
	|			И втСведения.СчетУчетаЦФПоДаннымУчета = ХозрасчетныйОстаткиЦФ.Счет
	|ГДЕ
	|	НЕ ЕСТЬNULL(ХозрасчетныйОстатки.Счет, ХозрасчетныйОстаткиЦФ.Счет) ЕСТЬ NULL
	|;
	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйОстатки.Субконто1 КАК ОсновноеСредство,
	|	ХозрасчетныйОстатки.Счет КАК СчетУчета,
	|	ХозрасчетныйОстатки.СуммаОстаток КАК Сумма
	|ПОМЕСТИТЬ втСтоимости08
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(
	|			&Дата,
	|			Счет В Иерархии(&СчетУчета),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства),
	|			Организация = &Организация
	|				И Подразделение = &Подразделение
	|				И (НЕ &ЗаполнитьПоСпискуОС
	|					ИЛИ Субконто1 В
	|						(ВЫБРАТЬ
	|							Т.ОсновноеСредство
	|						ИЗ
	|							втДанныеДокумента КАК Т))) КАК ХозрасчетныйОстатки
	
	|ОБЪЕДИНИТЬ ВСЕ
	
	|ВЫБРАТЬ
	|	ХозрасчетныйОстатки.Субконто1,
	|	ХозрасчетныйОстатки.Счет,
	|	ХозрасчетныйОстатки.СуммаОстаток
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(
	|			&Дата,
	|			Счет В Иерархии(&СчетУчета),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОбъектыСтроительства),
	|			Организация = &Организация
	|				И Подразделение = &Подразделение
	|				И (НЕ &ЗаполнитьПоСпискуОС
	|					ИЛИ Субконто1 В
	|						(ВЫБРАТЬ
	|							Т.ОсновноеСредство
	|						ИЗ
	|							втДанныеДокумента КАК Т))) КАК ХозрасчетныйОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДокументыНаОсновании.Ссылка КАК Ссылка,
	|	втДокументыНаОсновании.ОсновноеСредство КАК ОсновноеСредство,
	|	втДокументыНаОсновании.Подразделение КАК Подразделение,
	|	втДокументыНаОсновании.ПодразделениеПолучатель КАК ПодразделениеПолучатель,
	|	втДокументыНаОсновании.Действие
	|ИЗ
	|	втДокументыНаОсновании КАК втДокументыНаОсновании
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДанныеДокумента.ИндексСтроки КАК ИндексСтроки,
	|	втДанныеДокумента.ОсновноеСредство КАК ОсновноеСредство,
	|	ВЫБОР
	|		КОГДА втДанныеДокумента.СчетУчета = втСтоимости08.СчетУчета
	|			ТОГДА &Организация
	|		ИНАЧЕ втСведения.Организация
	|	КОНЕЦ КАК Организация,
	|	втСведения.АрендодательОрганизация КАК АрендодательОрганизация,
	|	втСведения.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ВЫБОР
	|		КОГДА втДанныеДокумента.СчетУчета = втСтоимости08.СчетУчета
	|				ИЛИ втДанныеДокумента.СчетУчета = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|					И НЕ втСтоимости08.СчетУчета ЕСТЬ NULL
	|			ТОГДА &Подразделение
	|		ИНАЧЕ втСведения.Подразделение
	|	КОНЕЦ КАК Подразделение,
	|	втСведения.МОЛ КАК МОЛ,
	|	ЕСТЬNULL(втСтоимости01.СчетУчета, ЕСТЬNULL(втСтоимости08.СчетУчета, втСведения.СчетУчета)) КАК СчетУчета,
	|	ЕСТЬNULL(втСтоимости01.Сумма, втСтоимости08.Сумма) КАК СтоимостьПоДаннымУчета,
	|	втСведения.Состояние КАК Состояние,
	|	(втСведения.Подразделение = &Подразделение
	|		ИЛИ втДанныеДокумента.СчетУчета = втСтоимости08.СчетУчета
	|		ИЛИ втДанныеДокумента.СчетУчета = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|			И НЕ втСтоимости08.СчетУчета ЕСТЬ NULL)
	|		И (втДанныеДокумента.МОЛ = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|				И НЕ втСведения.МОЛПоДаннымУчета ЕСТЬ NULL
	|			ИЛИ втСведения.МОЛПоДаннымУчета = втДанныеДокумента.МОЛ)
	|		И (втДанныеДокумента.СчетУчета = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|				И НЕ(втСведения.СчетУчетаПоДаннымУчета ЕСТЬ NULL
	|						И втСтоимости08.СчетУчета ЕСТЬ NULL)
	|			ИЛИ втСведения.СчетУчетаПоДаннымУчета = втДанныеДокумента.СчетУчета
	|			ИЛИ втДанныеДокумента.СчетУчета = втСтоимости08.СчетУчета) КАК НаличиеПоДаннымУчета,
	|	втСведения.СчетУчетаПоДаннымУчета КАК СчетУчетаПоДаннымУчета,
	|	втСведения.СчетУчетаЦФПоДаннымУчета КАК СчетУчетаЦФПоДаннымУчета,
	|	втСведения.МОЛПоДаннымУчета КАК МОЛПоДаннымУчета
	|ИЗ
	|	втДанныеДокумента КАК втДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ втСведения КАК втСведения
	|		ПО втДанныеДокумента.ОсновноеСредство = втСведения.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ втСтоимости01 КАК втСтоимости01
	|		ПО втДанныеДокумента.ОсновноеСредство = втСтоимости01.ОсновноеСредство
	|			И (втДанныеДокумента.СчетУчета = втСтоимости01.СчетУчета
	|				ИЛИ втДанныеДокумента.СчетУчета = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка))
	|		ЛЕВОЕ СОЕДИНЕНИЕ втСтоимости08 КАК втСтоимости08
	|		ПО втДанныеДокумента.ОсновноеСредство = втСтоимости08.ОсновноеСредство
	|			И (втДанныеДокумента.СчетУчета = втСтоимости08.СчетУчета
	|				ИЛИ втДанныеДокумента.СчетУчета = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|					И втСтоимости01.СчетУчета ЕСТЬ NULL)
	|ГДЕ
	|	&ЗаполнитьПоСпискуОС
	
	|ОБЪЕДИНИТЬ ВСЕ
	
	|ВЫБРАТЬ
	|	0,
	|	втСведения.ОсновноеСредство,
	|	втСведения.Организация,
	|	втСведения.АрендодательОрганизация,
	|	втСведения.ИнвентарныйНомер,
	|	втСведения.Подразделение,
	|	втСведения.МОЛ,
	|	ЕСТЬNULL(втСтоимости01.СчетУчета, втСведения.СчетУчета),
	|	втСтоимости01.Сумма,
	|	втСведения.Состояние,
	|	втСведения.Состояние В (ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ПринятоКУчету), ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ПринятоКЗабалансовомуУчету)),
	|	втСведения.СчетУчетаПоДаннымУчета,
	|	втСведения.СчетУчетаЦФПоДаннымУчета,
	|	втСведения.МОЛПоДаннымУчета
	|ИЗ
	|	втСведения КАК втСведения
	|		ЛЕВОЕ СОЕДИНЕНИЕ втСтоимости01 КАК втСтоимости01
	|		ПО втСведения.ОсновноеСредство = втСтоимости01.ОсновноеСредство
	|			И втСведения.СчетУчетаПоДаннымУчета = втСтоимости01.СчетУчета
	|ГДЕ
	|	НЕ &ЗаполнитьПоСпискуОС
	
	|ОБЪЕДИНИТЬ ВСЕ
	
	|ВЫБРАТЬ
	|	0,
	|	втСтоимости08.ОсновноеСредство,
	|	&Организация,
	|	ЛОЖЬ,
	|	"""",
	|	&Подразделение,
	|	НЕОПРЕДЕЛЕНО,
	|	втСтоимости08.СчетУчета,
	|	втСтоимости08.Сумма,
	|	НЕОПРЕДЕЛЕНО,
	|	ИСТИНА,
	|	втСтоимости08.СчетУчета,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО
	|ИЗ
	|	втСтоимости08 КАК втСтоимости08
	|ГДЕ
	|	НЕ &ЗаполнитьПоСпискуОС";
	
	#КонецОбласти
	
	Пакет = Запрос.ВыполнитьПакет();
	ЗаполнитьКэшированныеЗначенияДокументовНаОсновании(Пакет[Пакет.Количество()-2]);
	
	Результат = Пакет[Пакет.Количество()-1];
	
	Если Не ЗаполнитьПоСпискуОС Тогда
		Объект.ОС.Очистить();
	КонецЕсли;
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Строка = ?(ЗаполнитьПоСпискуОС, Объект.ОС[Выборка.ИндексСтроки], Объект.ОС.Добавить());
		ЗаполнитьЗначенияСвойств(Строка, Выборка);
		Строка.ЭтоСчетГруппы08 = (СчетаГруппы08.НайтиПоЗначению(Строка.СчетУчета)<>Неопределено);
		РассчитатьВычисляемыеПоляПоСтроке(Строка);
		ЗаполнитьДействие(Строка, Объект.ПодразделениеОрганизации, КэшированныеЗначенияДокументовНаОсновании);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ОбработкаВыбораПосле(ВыбранноеЗначение, ИсточникВыбора)
	
	ЗаполнитьПоСчетуСервер(ВыбранноеЗначение);	

КонецПроцедуры




