
&НаКлиенте
//Процедура для добавления нового типа аналитики расчетов
Процедура Расш1_ВариантРаспределенияРасходовРеглПриИзмененииПосле(Элемент)
	
	Если Объект.ВариантРаспределенияРасходовРегл = ПредопределенноеЗначение("Перечисление.ВариантыРаспределенияРасходов.НаНаправленияДеятельности")ИЛИ
		Объект.ВариантРаспределенияРасходовРегл = ПредопределенноеЗначение("Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты") Тогда	
		ТипЗнач = "СправочникСсылка.ПартииТМЦВЭксплуатации";
		Если Элементы.ТипЗначения.СписокВыбора.НайтиПоЗначению(ТипЗнач)= Неопределено Тогда
			Список = Элементы.ТипЗначения.СписокВыбора;
			Список.Добавить(ТипЗнач,"Партия ТМЦ в эксплуатации",Ложь,);
		КонецЕсли;
	Иначе
		ТипЗнач = "СправочникСсылка.ПартииТМЦВЭксплуатации";
		Если Элементы.ТипЗначения.СписокВыбора.НайтиПоЗначению(ТипЗнач)<> Неопределено Тогда
			Список = Элементы.ТипЗначения.СписокВыбора;
			ИндексВСписке = Список.Индекс(Элементы.ТипЗначения.СписокВыбора.НайтиПоЗначению(ТипЗнач));
			Список.Удалить(ИндексВСписке);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
//Процедура для добавления нового типа аналитики расчетов
Процедура Расш1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Если Объект.ВариантРаспределенияРасходовРегл = ПредопределенноеЗначение("Перечисление.ВариантыРаспределенияРасходов.НаНаправленияДеятельности")ИЛИ
		Объект.ВариантРаспределенияРасходовРегл = ПредопределенноеЗначение("Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты") Тогда	
		ТипЗнач = "СправочникСсылка.ПартииТМЦВЭксплуатации";
		Если Элементы.ТипЗначения.СписокВыбора.НайтиПоЗначению(ТипЗнач)= Неопределено Тогда
			Список = Элементы.ТипЗначения.СписокВыбора;
			Список.Добавить(ТипЗнач,"Партия ТМЦ в эксплуатации",Ложь,);
		КонецЕсли;
	Иначе
		ТипЗнач = "СправочникСсылка.ПартииТМЦВЭксплуатации";
		Если Элементы.ТипЗначения.СписокВыбора.НайтиПоЗначению(ТипЗнач)<> Неопределено Тогда
			Список = Элементы.ТипЗначения.СписокВыбора;
			ИндексВСписке = Список.Индекс(Элементы.ТипЗначения.СписокВыбора.НайтиПоЗначению(ТипЗнач));
			Список.Удалить(ИндексВСписке);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&Вместо("УстановитьТипЗначения")
Процедура Расш1_УстановитьТипЗначения(ВыбранныйТипЗначения)
	
	Если ВыбранныйТипЗначения = Неопределено Тогда
		Если ПолучитьФункциональнуюОпцию("БазоваяВерсия") Тогда
			ВыбранныйТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Склады");
		Иначе
			ВыбранныйТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Организации");
		КонецЕсли;
	КонецЕсли;
	
	СписокТиповЗначений = Новый СписокЗначений;
	СписокТиповЗначений.Добавить("СправочникСсылка.МаркетинговыеМероприятия");
	СписокТиповЗначений.Добавить("СправочникСсылка.НаправленияДеятельности");
	СписокТиповЗначений.Добавить("СправочникСсылка.СделкиСКлиентами");
	СписокТиповЗначений.Добавить("ДокументСсылка.ЗаказКлиента");
	СписокТиповЗначений.Добавить("СправочникСсылка.Склады");
	СписокТиповЗначений.Добавить("СправочникСсылка.Кассы");
	СписокТиповЗначений.Добавить("СправочникСсылка.Номенклатура");
	СписокТиповЗначений.Добавить("ДокументСсылка.ЗаказПоставщику");
	СписокТиповЗначений.Добавить("ДокументСсылка.ПриобретениеТоваровУслуг");
	СписокТиповЗначений.Добавить("ДокументСсылка.ЗаказНаПеремещение");
	СписокТиповЗначений.Добавить("ДокументСсылка.РеализацияТоваровУслуг");
	СписокТиповЗначений.Добавить("ДокументСсылка.ПеремещениеТоваров");
	СписокТиповЗначений.Добавить("ДокументСсылка.ПередачаТоваровМеждуОрганизациями");
	СписокТиповЗначений.Добавить("ДокументСсылка.РеализацияТоваровУслуг");
	СписокТиповЗначений.Добавить("СправочникСсылка.ПрочиеРасходы");
	СписокТиповЗначений.Добавить("СправочникСсылка.ПрочиеАктивыПассивы");
	СписокТиповЗначений.Добавить("СправочникСсылка.Партнеры");
	СписокТиповЗначений.Добавить("СправочникСсылка.Организации");
	СписокТиповЗначений.Добавить("СправочникСсылка.ФизическиеЛица");
	СписокТиповЗначений.Добавить("СправочникСсылка.СтруктураПредприятия");
	СписокТиповЗначений.Добавить("СправочникСсылка.Проекты");
	СписокТиповЗначений.Добавить("СправочникСсылка.ПретензииКлиентов");
	СписокТиповЗначений.Добавить("СправочникСсылка.ДоговорыКредитовИДепозитов");
	//++ НЕ УТКА
	СписокТиповЗначений.Добавить("ДокументСсылка.ЗаказНаПроизводство");
	СписокТиповЗначений.Добавить("ДокументСсылка.ЗаказНаПроизводство2_2");
	//-- НЕ УТКА
	//++ НЕ УТ
	СписокТиповЗначений.Добавить("СправочникСсылка.ОбъектыЭксплуатации");
	СписокТиповЗначений.Добавить("СправочникСсылка.ОбъектыСтроительства");
	СписокТиповЗначений.Добавить("СправочникСсылка.НематериальныеАктивы");
	СписокТиповЗначений.Добавить("ПеречислениеСсылка.ВидыОперацийПоЗарплате");
	//-- НЕ УТ
	СписокТиповЗначений.Добавить("ПеречислениеСсылка.АналитикаКурсовыхРазниц");
	СписокТиповЗначений.Добавить("ДокументСсылка.ЗаказНаСборку");
	СписокТиповЗначений.Добавить("ДокументСсылка.СборкаТоваров");
	СписокТиповЗначений.Добавить("ДокументСсылка.ВводОстатков");
	СписокТиповЗначений.Добавить("ДокументСсылка.ПоступлениеТоваров");
	
	//НТК+ Валитова 05.10.2017 - Добавлен новый тип аналитики расходов: Справочник "Партии ТМЦ в эксплуатации"
	Если Объект.ВариантРаспределенияРасходовРегл = ПредопределенноеЗначение("Перечисление.ВариантыРаспределенияРасходов.НаНаправленияДеятельности")ИЛИ
		Объект.ВариантРаспределенияРасходовРегл = ПредопределенноеЗначение("Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты") Тогда	
		СписокТиповЗначений.Добавить("СправочникСсылка.ПартииТМЦВЭксплуатации"); 
	КонецЕсли;
	//НТК+ Валитова 05.10.2017
	
	Для Каждого ЭлементСписка Из СписокТиповЗначений Цикл
		Если ВыбранныйТипЗначения.СодержитТип(Тип(ЭлементСписка.Значение)) Тогда
			Если ЭлементСписка.Значение = "СправочникСсылка.ОбъектыЭксплуатации"
			 И Объект.ВидЦенностиНДС = Перечисления.ВидыЦенностей.ОбъектыНезавершенногоСтроительства Тогда
				ТипЗначения = "СправочникСсылка.ОбъектыСтроительства22";
			Иначе
				ТипЗначения = ЭлементСписка.Значение;
			КонецЕсли;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры




