&НаКлиенте
Перем мНТК_Амортизация;
&НаКлиенте
Перем мНТК_АмортизационнаяПремия;
&НаКлиенте
Перем мНТК_ИмущественныеНалоги;

&НаСервере
Процедура Расш1_АмортизационнаяГруппаПриИзмененииПослеНаСервере()
	
	Если Объект.АмортизационнаяГруппа = Перечисления.АмортизационныеГруппы.ПерваяГруппа Тогда
		Объект.СрокИспользованияБУ = 1*12+1;
		Объект.СрокИспользованияНУ = 1*12+1;
		НУСрокИспользованияРасшифровка = "1 год 1 месяц";
		БУСрокИспользованияРасшифровка = "1 год 1 месяц";
	ИначеЕсли Объект.АмортизационнаяГруппа = Перечисления.АмортизационныеГруппы.ВтораяГруппа Тогда
		Объект.СрокИспользованияБУ = 2*12+1;
		Объект.СрокИспользованияНУ = 2*12+1;
		НУСрокИспользованияРасшифровка = "2 года 1 месяц";
		БУСрокИспользованияРасшифровка = "2 года 1 месяц";
	ИначеЕсли Объект.АмортизационнаяГруппа = Перечисления.АмортизационныеГруппы.ТретьяГруппа Тогда
		Объект.СрокИспользованияБУ = 3*12+1;
		Объект.СрокИспользованияНУ = 3*12+1;
		НУСрокИспользованияРасшифровка = "3 года 1 месяц";
		БУСрокИспользованияРасшифровка = "3 года 1 месяц";
	ИначеЕсли Объект.АмортизационнаяГруппа = Перечисления.АмортизационныеГруппы.ЧетвертаяГруппа Тогда
		Объект.СрокИспользованияБУ = 5*12+1;
		Объект.СрокИспользованияНУ = 5*12+1;
		НУСрокИспользованияРасшифровка = "5 лет 1 месяц";
		БУСрокИспользованияРасшифровка = "5 лет 1 месяц";
	ИначеЕсли Объект.АмортизационнаяГруппа = Перечисления.АмортизационныеГруппы.ПятаяГруппа Тогда
		Объект.СрокИспользованияБУ = 7*12+1;
		Объект.СрокИспользованияНУ = 7*12+1;
		НУСрокИспользованияРасшифровка = "7 лет 1 месяц";
		БУСрокИспользованияРасшифровка = "7 лет 1 месяц";
	ИначеЕсли Объект.АмортизационнаяГруппа = Перечисления.АмортизационныеГруппы.ШестаяГруппа Тогда
		Объект.СрокИспользованияБУ = 10*12+1;
		Объект.СрокИспользованияНУ = 10*12+1;
		НУСрокИспользованияРасшифровка = "10 лет 1 месяц";
		БУСрокИспользованияРасшифровка = "10 лет 1 месяц";
	ИначеЕсли Объект.АмортизационнаяГруппа = Перечисления.АмортизационныеГруппы.СедьмаяГруппа Тогда
		Объект.СрокИспользованияНУ = 15*12+1;
		Объект.СрокИспользованияБУ = 15*12+1;
		НУСрокИспользованияРасшифровка = "15 лет 1 месяц";
		БУСрокИспользованияРасшифровка = "15 лет 1 месяц";
	ИначеЕсли Объект.АмортизационнаяГруппа = Перечисления.АмортизационныеГруппы.ВосьмаяГруппа Тогда
		Объект.СрокИспользованияБУ = 20*12+1;
		Объект.СрокИспользованияНУ = 20*12+1;
		НУСрокИспользованияРасшифровка = "20 лет 1 месяц";
		БУСрокИспользованияРасшифровка = "20 лет 1 месяц";
	ИначеЕсли Объект.АмортизационнаяГруппа = Перечисления.АмортизационныеГруппы.ДевятаяГруппа Тогда
		Объект.СрокИспользованияБУ = 25*12+1;
		Объект.СрокИспользованияНУ = 25*12+1;
		НУСрокИспользованияРасшифровка = "25 лет 1 месяц";
		БУСрокИспользованияРасшифровка = "25 лет 1 месяц";
	ИначеЕсли Объект.АмортизационнаяГруппа = Перечисления.АмортизационныеГруппы.ДесятаяГруппа Тогда
		Объект.СрокИспользованияБУ = 30*12+1;
		Объект.СрокИспользованияНУ = 30*12+1;
		НУСрокИспользованияРасшифровка = "30 лет 1 месяц";
		БУСрокИспользованияРасшифровка = "30 лет 1 месяц";
	ИначеЕсли Объект.АмортизационнаяГруппа = Перечисления.АмортизационныеГруппы.ОтдельнаяГруппа Тогда
		Объект.СрокИспользованияБУ = 0;
		Объект.СрокИспользованияНУ = 0;
		НУСрокИспользованияРасшифровка = "";
		БУСрокИспользованияРасшифровка = "";
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура Расш1_АмортизационнаяГруппаПриИзмененииПосле(Элемент)
	
	Расш1_АмортизационнаяГруппаПриИзмененииПослеНаСервере();
	
КонецПроцедуры


&НаСервере
Процедура Расш1_ОбработкаОповещенияПослеНаСервере(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ВыборАмортизационнойГруппыОС" И Источник = ЭтаФорма.УникальныйИдентификатор Тогда
		
		Если Объект.АмортизационнаяГруппа = Перечисления.АмортизационныеГруппы.ПерваяГруппа Тогда
			Объект.СрокИспользованияБУ = 1*12+1;
			Объект.СрокИспользованияНУ = 1*12+1;
			НУСрокИспользованияРасшифровка = "1 год 1 месяц";
			БУСрокИспользованияРасшифровка = "1 год 1 месяц";
		ИначеЕсли Объект.АмортизационнаяГруппа = Перечисления.АмортизационныеГруппы.ВтораяГруппа Тогда
			Объект.СрокИспользованияБУ = 2*12+1;
			Объект.СрокИспользованияНУ = 2*12+1;
			НУСрокИспользованияРасшифровка = "2 года 1 месяц";
			БУСрокИспользованияРасшифровка = "2 года 1 месяц";
		ИначеЕсли Объект.АмортизационнаяГруппа = Перечисления.АмортизационныеГруппы.ТретьяГруппа Тогда
			Объект.СрокИспользованияБУ = 3*12+1;
			Объект.СрокИспользованияНУ = 3*12+1;
			НУСрокИспользованияРасшифровка = "3 года 1 месяц";
			БУСрокИспользованияРасшифровка = "3 года 1 месяц";
		ИначеЕсли Объект.АмортизационнаяГруппа = Перечисления.АмортизационныеГруппы.ЧетвертаяГруппа Тогда
			Объект.СрокИспользованияБУ = 5*12+1;
			Объект.СрокИспользованияНУ = 5*12+1;
			НУСрокИспользованияРасшифровка = "5 лет 1 месяц";
			БУСрокИспользованияРасшифровка = "5 лет 1 месяц";
		ИначеЕсли Объект.АмортизационнаяГруппа = Перечисления.АмортизационныеГруппы.ПятаяГруппа Тогда
			Объект.СрокИспользованияБУ = 7*12+1;
			Объект.СрокИспользованияНУ = 7*12+1;
			НУСрокИспользованияРасшифровка = "7 лет 1 месяц";
			БУСрокИспользованияРасшифровка = "7 лет 1 месяц";
		ИначеЕсли Объект.АмортизационнаяГруппа = Перечисления.АмортизационныеГруппы.ШестаяГруппа Тогда
			Объект.СрокИспользованияБУ = 10*12+1;
			Объект.СрокИспользованияНУ = 10*12+1;
			НУСрокИспользованияРасшифровка = "10 лет 1 месяц";
			БУСрокИспользованияРасшифровка = "10 лет 1 месяц";
		ИначеЕсли Объект.АмортизационнаяГруппа = Перечисления.АмортизационныеГруппы.СедьмаяГруппа Тогда
			Объект.СрокИспользованияНУ = 15*12+1;
			Объект.СрокИспользованияБУ = 15*12+1;
			НУСрокИспользованияРасшифровка = "15 лет 1 месяц";
			БУСрокИспользованияРасшифровка = "15 лет 1 месяц";
		ИначеЕсли Объект.АмортизационнаяГруппа = Перечисления.АмортизационныеГруппы.ВосьмаяГруппа Тогда
			Объект.СрокИспользованияБУ = 20*12+1;
			Объект.СрокИспользованияНУ = 20*12+1;
			НУСрокИспользованияРасшифровка = "20 лет 1 месяц";
			БУСрокИспользованияРасшифровка = "20 лет 1 месяц";
		ИначеЕсли Объект.АмортизационнаяГруппа = Перечисления.АмортизационныеГруппы.ДевятаяГруппа Тогда
			Объект.СрокИспользованияБУ = 25*12+1;
			Объект.СрокИспользованияНУ = 25*12+1;
			НУСрокИспользованияРасшифровка = "25 лет 1 месяц";
			БУСрокИспользованияРасшифровка = "25 лет 1 месяц";
		ИначеЕсли Объект.АмортизационнаяГруппа = Перечисления.АмортизационныеГруппы.ДесятаяГруппа Тогда
			Объект.СрокИспользованияБУ = 30*12+1;
			Объект.СрокИспользованияНУ = 30*12+1;
			НУСрокИспользованияРасшифровка = "30 лет 1 месяц";
			БУСрокИспользованияРасшифровка = "30 лет 1 месяц";
		ИначеЕсли Объект.АмортизационнаяГруппа = Перечисления.АмортизационныеГруппы.ОтдельнаяГруппа Тогда
			Объект.СрокИспользованияБУ = 0;
			Объект.СрокИспользованияНУ = 0;
			НУСрокИспользованияРасшифровка = "";
			БУСрокИспользованияРасшифровка = "";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура Расш1_ОбработкаОповещенияПосле(ИмяСобытия, Параметр, Источник)
	
	Расш1_ОбработкаОповещенияПослеНаСервере(ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры


&НаКлиенте
Процедура Расш1_АналитикаРасходовНалогНачалоВыбораПосле(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	мНТК_Амортизация = Ложь;
	мНТК_АмортизационнаяПремия = Ложь;
	мНТК_ИмущественныеНалоги = Истина;

	ПартииТМЦ =  Расш1_ОпределениеТипаАналитики.Расш1_ОпределениеТипаАналитикиНаСервере(Объект.СтатьяРасходовНалог);
	Если ПартииТМЦ Тогда
		СтандартнаяОбработка = Ложь;
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ДатаДокумента",Объект.Дата);
		ПараметрыПодбора = Новый Структура("ЗакрыватьПриВыборе, МножественныйВыбор,РежимВыбора, ДополнительныеПараметры", Истина, Ложь, Истина, ДополнительныеПараметры);
		ОткрытьФорму("Справочник.ПартииТМЦВЭксплуатации.Форма.ФормаПодбора", ПараметрыПодбора, ЭтаФорма);
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура Расш1_ОбработкаВыбораПосле(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Справочник.ПартииТМЦВЭксплуатации.Форма.ФормаПодбора" Тогда
		Если ТипЗнч(ВыбранноеЗначение) = Тип("ФиксированныйМассив") Тогда
			СтандартнаяОбработка = Ложь;
			Для Каждого Значение ИЗ ВыбранноеЗначение Цикл
				Если мНТК_Амортизация Тогда
					Объект.АналитикаРасходов = Значение.ПартияТМЦВЭксплуатации;
				ИначеЕсли мНТК_АмортизационнаяПремия Тогда
					Объект.АналитикаРасходовАмортизационнойПремии = Значение.ПартияТМЦВЭксплуатации;
				ИначеЕсли мНТК_ИмущественныеНалоги Тогда
					Объект.АналитикаРасходовНалог = Значение.ПартияТМЦВЭксплуатации;
				КонецЕсли;				
			КонецЦикла;
			Модифицированность = Истина;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура Расш1_АналитикаРасходовНачалоВыбораПосле(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	мНТК_Амортизация = Истина;
	мНТК_АмортизационнаяПремия = Ложь;
	мНТК_ИмущественныеНалоги = Ложь;
	ПартииТМЦ =  Расш1_ОпределениеТипаАналитики.Расш1_ОпределениеТипаАналитикиНаСервере(Объект.СтатьяРасходов);
	Если ПартииТМЦ Тогда
		СтандартнаяОбработка = Ложь;
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ДатаДокумента",Объект.Дата);
		ПараметрыПодбора = Новый Структура("ЗакрыватьПриВыборе, МножественныйВыбор,РежимВыбора, ДополнительныеПараметры", Истина, Ложь, Истина, ДополнительныеПараметры);
		ОткрытьФорму("Справочник.ПартииТМЦВЭксплуатации.Форма.ФормаПодбора", ПараметрыПодбора, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура Расш1_АналитикаРасходовАмортизационнойПремииНачалоВыбораПосле(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	мНТК_Амортизация = Ложь;
	мНТК_АмортизационнаяПремия = Истина;
	мНТК_ИмущественныеНалоги = Ложь;
	ПартииТМЦ =  Расш1_ОпределениеТипаАналитики.Расш1_ОпределениеТипаАналитикиНаСервере(Объект.СтатьяРасходовАмортизационнойПремии);
	Если ПартииТМЦ Тогда
		СтандартнаяОбработка = Ложь;
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ДатаДокумента",Объект.Дата);
		ПараметрыПодбора = Новый Структура("ЗакрыватьПриВыборе, МножественныйВыбор,РежимВыбора, ДополнительныеПараметры", Истина, Ложь, Истина, ДополнительныеПараметры);
		ОткрытьФорму("Справочник.ПартииТМЦВЭксплуатации.Форма.ФормаПодбора", ПараметрыПодбора, ЭтаФорма);
	КонецЕсли;

КонецПроцедуры

