Функция Расш1_ОпределениеТипаАналитикиНаСервере(СтатьяРасходов) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтатьиРасходов.ТипЗначения КАК ТипАналитикиРасходов
	|ИЗ
	|	ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиРасходов
	|ГДЕ
	|	СтатьиРасходов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СтатьяРасходов);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.ТипАналитикиРасходов = Новый ОписаниеТипов("СправочникСсылка.ПартииТМЦВЭксплуатации"); 	
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции
