
&Вместо("ТипыДокументовКПоследовательномуОтражению")
Функция Расш1_ТипыДокументовКПоследовательномуОтражению()
	Результат = Новый Массив;
	
	// Документы учета ОС
	Результат.Добавить(Тип("ДокументСсылка.ВводОстатковВнеоборотныхАктивов"));
	Результат.Добавить(Тип("ДокументСсылка.ПринятиеКУчетуОС"));
	Результат.Добавить(Тип("ДокументСсылка.МодернизацияОС"));
	Результат.Добавить(Тип("ДокументСсылка.ПеремещениеОС"));
	Результат.Добавить(Тип("ДокументСсылка.ПодготовкаКПередачеОС"));
	Результат.Добавить(Тип("ДокументСсылка.СписаниеОС"));
	Результат.Добавить(Тип("ДокументСсылка.АмортизацияОС"));
	Результат.Добавить(Тип("ДокументСсылка.ИзменениеПараметровОС"));
	Результат.Добавить(Тип("ДокументСсылка.ПередачаОСАрендатору"));
	Результат.Добавить(Тип("ДокументСсылка.ВозвратОСОтАрендатора"));
	Результат.Добавить(Тип("ДокументСсылка.ПоступлениеАрендованныхОС"));
	Результат.Добавить(Тип("ДокументСсылка.ВыбытиеАрендованныхОС"));
	Результат.Добавить(Тип("ДокументСсылка.ПереоценкаОС"));
	//НТК Алексеева 24.10.2017 Начало Блока
	Результат.Добавить(Тип("ДокументСсылка.НТК_ОбъединениеРазъединениеОС"));
	//НТК Алексеева 24.10.2017 Конец Блока

	// Документы учета НМА
	Результат.Добавить(Тип("ДокументСсылка.ПринятиеКУчетуНМА"));
	Результат.Добавить(Тип("ДокументСсылка.СписаниеНМА"));
	Результат.Добавить(Тип("ДокументСсылка.АмортизацияНМА"));
	Результат.Добавить(Тип("ДокументСсылка.ПодготовкаКПередачеНМА"));
	Результат.Добавить(Тип("ДокументСсылка.ПереоценкаНМА"));
	
	// Регламентные документы не требуется отражать пакетно
	Результат.Добавить(Тип("ДокументСсылка.РаспределениеНДС"));
	Результат.Добавить(Тип("ДокументСсылка.РасчетСебестоимостиТоваров"));
	Результат.Добавить(Тип("ДокументСсылка.РаспределениеДоходовИРасходовПоНаправлениямДеятельности"));
	Результат.Добавить(Тип("ДокументСсылка.РегламентнаяОперация"));
	
	Возврат Результат;
КонецФункции
