
//&Вместо("СформироватьЭтапыЗакрытияМесяца")
//Функция нтк_СформироватьЭтапыЗакрытияМесяца()
//	
//	// Вставить содержимое метода.
//	Результат = ПродолжитьВызов();
//	
//	СтруктураПоиска = Новый Структура;
//	СтруктураПоиска.Вставить("Код",Перечисления.ОперацииЗакрытияМесяца.ФормированиеФинансовогоРезультата);
//	РезультатПоиска =  Результат.найтиСтроки(СтруктураПоиска);
//	Если РезультатПоиска.Количество()>0 Тогда
//		Индекс = РезультатПоиска[0].ТипыРегламентныхОпераций.Найти(Перечисления.ТипыРегламентныхОпераций.РасчетНалогаНаПрибыль);
//		Если Индекс = Неопределено Тогда
//			Индекс = РезультатПоиска[0].ТипыРегламентныхОпераци.Количество()-1;
//		Иначе
//			Индекс = Индекс +1;
//		КонецЕсли;	
//		НоваяСтрока = РезультатПоиска[0].ТипыРегламентныхОпераций;
//		НоваяСтрока.Вставить(Индекс,Перечисления.ТипыРегламентныхОпераций.нтк_ФормированиеПроводокПоРасчетуНалогаНаПрибыль);
//	КонецЕсли;	
//	
//	//добавление новой операции по ведению НДС по кодам деятельности
//	ТекущийРодитель = ИдентификаторГруппыРучныеОперации();
//	
//	НоваяСтрока = ДобавитьЭтапВТаблицу(Результат, ТекущийРодитель,
//		Перечисления.ОперацииЗакрытияМесяца.НТК_ЗаполнениеКодовДеятельностиНДС,
//		Ложь, Истина, Ложь);
//	НоваяСтрока.ВыполняетсяВручную = Истина;
//	НоваяСтрока.ТекстВыполнить = НСтр("ru='Выполнить'");
//	
//	НоваяСтрока.ДействиеИспользование = ОписаниеДействия_СервернаяПроцедура(
//		"нтк_ЗакрытиеМесяцаСервер.Использование_НТК_ЗаполнениеКодовДеятельностиНДС");
//	НоваяСтрока.ДействиеВыполнить  = ОписаниеДействия_ОткрытьФорму(
//		Метаданные.Обработки.нтк_ЗаполнениеКодаДеятельностиНДСДляРТУ.Формы.Форма.ПолноеИмя());
//	НоваяСтрока.Наименование = НоваяСтрока.Код;
//	НоваяСтрока.Состояние =Перечисления.СостоянияОперацийЗакрытияМесяца.Неопределено;
//	//НоваяСтрока.ДействиеВыполнить.ПараметрыФормы.ПериодРегистрации =Период;	

//	Возврат Результат;
//	
//КонецФункции

&Вместо("СформироватьГруппыЭтаповЗакрытияМесяца")
Функция Расш1_СформироватьГруппыЭтаповЗакрытияМесяца()
	
	Результат = ПродолжитьВызов();
	
	ИндексСтроки = Результат.Количество();
	
	РезультатПоиска = Результат.Найти("Себестоимость", "Код");
	Если РезультатПоиска <> Неопределено Тогда
		ИндексСтроки = Результат.Индекс(РезультатПоиска);
	КонецЕсли;

	НоваяСтрока = Результат.Вставить(ИндексСтроки + 1);
	НоваяСтрока.Код = "ОтражениеНДСПоСтроительствуХозСпособом";
	НоваяСтрока.Наименование = НСтр("ru='Отражение НДС по строительству хоз. способом'");
	
	Возврат Результат;
	
КонецФункции

&Вместо("СформироватьЭтапыЗакрытияМесяца")
Функция Расш1_СформироватьЭтапыЗакрытияМесяца()
	
	Результат = ПродолжитьВызов();
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Код",Перечисления.ОперацииЗакрытияМесяца.ФормированиеФинансовогоРезультата);
	РезультатПоиска =  Результат.найтиСтроки(СтруктураПоиска);
	Если РезультатПоиска.Количество()>0 Тогда
		Индекс = РезультатПоиска[0].ТипыРегламентныхОпераций.Найти(Перечисления.ТипыРегламентныхОпераций.РасчетНалогаНаПрибыль);
		Если Индекс = Неопределено Тогда
			Индекс = РезультатПоиска[0].ТипыРегламентныхОпераци.Количество()-1;
		Иначе
			Индекс = Индекс +1;
		КонецЕсли;	
		НоваяСтрока = РезультатПоиска[0].ТипыРегламентныхОпераций;
		НоваяСтрока.Вставить(Индекс,Перечисления.ТипыРегламентныхОпераций.нтк_ФормированиеПроводокПоРасчетуНалогаНаПрибыль);
	КонецЕсли;	
	
	//добавление новой операции по ведению НДС по кодам деятельности
	ТекущийРодитель = ИдентификаторГруппыРучныеОперации();
	
	НоваяСтрока = ДобавитьЭтапВТаблицу(Результат, ТекущийРодитель,
		Перечисления.ОперацииЗакрытияМесяца.НТК_ЗаполнениеКодовДеятельностиНДС,
		Ложь, Истина, Ложь);
	НоваяСтрока.ВыполняетсяВручную = Истина;
	НоваяСтрока.ТекстВыполнить = НСтр("ru='Выполнить'");
	
	НоваяСтрока.ДействиеИспользование = ОписаниеДействия_СервернаяПроцедура(
		"нтк_ЗакрытиеМесяцаСервер.Использование_НТК_ЗаполнениеКодовДеятельностиНДС");
	НоваяСтрока.ДействиеВыполнить  = ОписаниеДействия_ОткрытьФорму(
		Метаданные.Обработки.нтк_ЗаполнениеКодаДеятельностиНДСДляРТУ.Формы.Форма.ПолноеИмя());
	НоваяСтрока.Наименование = НоваяСтрока.Код;
	НоваяСтрока.Состояние =Перечисления.СостоянияОперацийЗакрытияМесяца.Неопределено;
	//НоваяСтрока.ДействиеВыполнить.ПараметрыФормы.ПериодРегистрации =Период;
	
	//НТК+ Благин 31.10.2017
	НоваяСтрока = ДобавитьЭтапВТаблицу(Результат, "ОтражениеНДСПоСтроительствуХозСпособом",
		Перечисления.ОперацииЗакрытияМесяца.НТК_ФормированиеДокументовОтражениеНДСПоСтроительствуХозяйственнымСпособом);
	
	НоваяСтрока.ДействиеОформление = ОписаниеДействия_СервернаяПроцедура(
		"ЗакрытиеМесяцаСервер.Оформление_ФормированиеДокументовОтражениеНДСПоСтроительствуХозяйственнымСпособом"); 
	НоваяСтрока.ДействиеИспользование = ОписаниеДействия_СервернаяПроцедура(
		"ЗакрытиеМесяцаСервер.Использование_ФормированиеДокументовОтражениеНДСПоСтроительствуХозяйственнымСпособом");
	НоваяСтрока.ДействиеВыполнить = ОписаниеДействия_ОткрытьФорму(
		"Документ.НТК_ОтражениеНДСПоСтроительствуХозСпособом.Форма.ФормаСписка");
		
	НоваяСтрока = ДобавитьЭтапВТаблицу(Результат, "ОтражениеНДСПоСтроительствуХозСпособом",
		Перечисления.ОперацииЗакрытияМесяца.НТК_ФормированиеСчетовФактурПоНДСПоСтроительствуХозяйственнымСпособом);
	
	НоваяСтрока.ДействиеОформление = ОписаниеДействия_СервернаяПроцедура(
		"ЗакрытиеМесяцаСервер.Оформление_ФормированиеСчетовФактурПоНДСПоСтроительствуХозяйственнымСпособом"); 
	НоваяСтрока.ДействиеИспользование = ОписаниеДействия_СервернаяПроцедура(
		"ЗакрытиеМесяцаСервер.Использование_ФормированиеСчетовФактурПоНДСПоСтроительствуХозяйственнымСпособом");
	НоваяСтрока.ДействиеВыполнить = ОписаниеДействия_ОткрытьФорму(
		"Документ.НТК_ОтражениеНДСПоСтроительствуХозСпособом.Форма.ФормаСпискаФормированияСчетФактур");
	//НТК- Благин 31.10.2017

	Возврат Результат;
	
КонецФункции


